"MudWalkerWebSite" = "http://mudwalker.cubik.org/";

"AccountDirItem" = "Account";
"TriggerDirItem" = "Trigger";
"AliasDirItem" = "Alias";
"KeyMacroDirItem" = "Macro";
"ColorSetDirItem" = "Color Set";

/* Text OWC displays tokens */
"TextOutputToken_MWTokenConnectionOpened" = "Connected.";
"TextOutputToken_MWTokenConnectionClosed" = "Disconnected.";
"TextOutputToken_MWTokenPingBack" = "Server is alive.";
"TextOutputToken_MWTokenPingCant" = "Can't ping.";
"TextOutputTokenGeneric_%@" = "<Token %@>";

/* Text OWC marks some roles specially */
"(MWLocalRole(@))" = "((@))";
"(MWEchoRole(@))" = "> @";
"(MWPromptRole(@))" = "@";

/* Varius alert panel/sheet strings */
"OutputWinCloseConfirm_Title" = "There is a connection open.";
"OutputWinCloseConfirm_Title%@" = "There is a connection open to ‘%@’.";
"OutputWinCloseConfirm_Message" = "Closing this window may disconnect it.";
"OutputWinCloseConfirm_NiceButton" = "Logout";
"OutputWinCloseConfirm_CloseButton" = "Close Anyway";
"OutputWinCloseConfirm_CancelButton" = "Cancel";

"NoClassForSchemeAlert_Title" = "Can't Handle Address URL";
"NoClassForSchemeAlert_Dismiss" = "Cancel";
"NoClassForSchemeAlert_Message%@" = "There is no plugin loaded that knows how to connect using a ‘%@’ URL.";

"AppQuitUnlinkPanel_Title" = "You have several terminal windows in use.";
"AppQuitUnlinkPanel_Message" = "What do you wish to do with them?";
"AppQuitUnlinkPanel_LogoutButton" = "Logout All";
"AppQuitUnlinkPanel_CancelButton" = "Cancel";
"AppQuitUnlinkPanel_QuitButton" = "Disconnect All";

"MWConfigPaneViewLoadFail_Title" = "Pane Load Error";
"MWConfigPaneViewLoadFail_Dismiss" = "OK";
"MWConfigPaneViewLoadFail_Message%@" = "The following configuration panes could not be displayed: %@.";
      
/* Misc */
"disconnected" = "disconnected";
"DefaultInputPanelTitle" = "Input";
"%@ Document Settings" = "%@: Settings";
"CharacterMenu%@" = "Ch: %@";
"_MWOutputWinCharSelect_None" = "None";
"MWTriggerFilter-NoLogoutScript" = "No logout script is available.";
"MWTriggerFilter-reCompileFailed%@%@" = "Could not compile pattern '%@': %@.";
"MWTriggerFilter-reMatchError%i%@" = "Internal error %i in matching pattern '%@'.";
"UnlinkedWindowSuffix" = " (unlinked)";
"LinkTraceConsoleDescription" = "Link Trace Console";
"NotificationMonitorConsoleDescription" = "Notification Monitor";
"ColorsModernizationColorSetNameSuffix" = " Custom";
"TriggerEnablePanelTitle%@" = "Triggers - %@";

/* Toolbar item names, toolbar tooltips */
"TBL_mwOpenConnection" = "Connect";
"TBT_mwOpenConnection" = "Connect to server";
"TBL_mwCloseConnectionHard" = "Disconnect"; 
"TBT_mwCloseConnectionHard" = "Disconnect by closing connection";
"TBL_mwCloseConnectionNice" = "Logout";     
"TBT_mwCloseConnectionNice" = "Disconnect by sending logout commands";
"TBL_mwUnlinkWindow" = "Unlink"; 
"TBT_mwUnlinkWindow" = "Detach this window from its connection and filters";
"TBL_mwSendPing" = "Ping";
"TBT_mwSendPing" = "Checks that the server is responding, if possible";
"TBL_mwSelectCharacter" = "Character";
"TBT_mwSelectCharacter" = "Character/user to log in as";
"TBL_mwOpenDocumentSettings" = "Settings";    
"TBT_mwOpenDocumentSettings" = "Open document settings window";

"TBL_mwClearScrollback" = "Clear";
"TBT_mwClearScrollback" = "Clears the text area";
"TBL_autoScrollLock" = "ScrLock";
"TBT_autoScrollLock" = "Toggles Scroll Lock, preventing the input window from scrolling when new text arrives.";

/* Input window toolbar */
"TBL_selectHistoryFirst" = "First";
"TBT_selectHistoryFirst" = "Choose earliest history item";
"TBL_selectHistoryPrev" = "Prev";
"TBT_selectHistoryPrev" = "Choose previous history item";
"TBL_selectHistoryNext" = "Next";
"TBT_selectHistoryNext" = "Choose next history item";
"TBL_selectHistoryLast" = "Last";
"TBT_selectHistoryLast" = "Choose latest history item";
"TBL_mwModeMain" = "Main";
"TBT_mwModeMain" = "Normal input mode";
"TBL_mwModePassword" = "Password";
"TBT_mwModePassword" = "Password input mode";

/* Library categories */
"Library Category Recent" = "Source: Recent Documents";
"Library Category Personal" = "Source: Personal";
"Library Category Computer" = "Source: This Computer";
"Library Category Network" = "Source: Local Network";
"Library Category Bundle" = "Source: MudWalker";

/* Exposed forms of class names and such. */
"MWTextOutputWinController" = "Text Window";
"MWOneLineRequestOutputWinController" = "Request Window";
"MWGUIOutputWindowController" = "GUI Window";
"MWAccountConfigPane-paneTitle" = "Accounts/Characters";
"MWAliasConfigPane-paneTitle" = "Aliases";
"MWTriggerConfigPane-paneTitle" = "Triggers";
"MWConnectionConfigPane-paneTitle" = "Connection";
"MWKeyMacroConfigPane-paneTitle" = "Keyboard Macros";
"MWDisplayConfigPane-paneTitle" = "Display";
"MWInputConfigPane-paneTitle" = "Input & History";
"MWColorSetConfigPane-paneTitle" = "Color Sets";
